БПКР/src/Documents/ОтчетПоВыплатамИУдержаниямПН/ОтчетПоВыплатамИУдержаниямПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПоВыплатамИУдержаниямПН</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Годовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>EnumRef.ВидыОтчетаПоНалогам</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отчет</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтраны</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНалоговойРегистрации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодДохода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОДПН</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПН</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтчетГодовой</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодДохода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОДПН</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоВыплаченноДохода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаМатериальнойВыгоды</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПН</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПНСМатериальнойВыгоды</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/InformationRegisters/СотрудникиПоТрудовымСоглашениям/СотрудникиПоТрудовымСоглашениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиПоТрудовымСоглашениям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/AccumulationRegisters/ПодоходныйНалог/ПодоходныйНалог.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПодоходныйНалог</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ДоплатаПН</name>
    <comment>Доплата подоходного налога</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МРД</name>
    <comment>Минимальный расчетный доход</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОДПН</name>
    <comment>Облагаемый доход подоходного налога</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОДСФ</name>
    <comment>Облагаемый доход соц.фонда</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вычеты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПН</name>
    <comment>Подоходный налог</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФР</name>
    <comment>Пенсионный фонд сотрудника с начала года</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГНПФР</name>
    <comment>Пенсионный фонд сотрудника с начала года</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРДляРасчетаПН</name>
    <comment>Пенсионный фонд сотрудника с начала года</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГНПФРДляРасчетаПН</name>
    <comment>Пенсионный фонд сотрудника с начала года</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МСР</name>
    <comment>Подоходный налог (арендодатели)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФОТР</name>
    <comment>Подоходный налог (арендодатели)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВсегоНачислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БПКР/src/InformationRegisters/ГражданствоФизическихЛиц/ГражданствоФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГражданствоФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ИспытательныйСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяТрудовогоКодекса</name>
    <type>
      <types>CatalogRef.СтатьиТрудовогоКодекса</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Enums/ВидыКадровыхСобытий/ВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКадровыхСобытий</name>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>НачальныеДанные</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Documents/ОтчетПоВыплатамИУдержаниямПН/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовБП.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);

	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда 
		ДатаНачала 	 = НачалоКвартала(Дата);
		ДатаОкончания = КонецКвартала(Дата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет табличную часть
//
Процедура ЗаполнитьТабличнуюЧастьОтчет() Экспорт
	
	// Квартальный отчет формируется только по сотрудникам,
	// на которых оформлен документ "Трудовое соглашение" (внештатные).
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК ФизЛицо,
		|	ХозрасчетныйОборотыДтКт.Организация КАК Организация,
		|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаПН
		|ПОМЕСТИТЬ ВременнаяТаблицаПрочиеФизЛица
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, , , , СчетКт = &СчетУчетаПоПНДляПрочихФизическихЛиц, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СотрудникиОрганизаций), Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиПоТрудовымСоглашениямСрезПоследних.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВременнаяТаблицаСотрудникиПоТрудовымСоглашениям
		|ИЗ
		|	РегистрСведений.СотрудникиПоТрудовымСоглашениям.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК СотрудникиПоТрудовымСоглашениямСрезПоследних
		|ГДЕ
		|	НЕ СотрудникиПоТрудовымСоглашениямСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СотрудникиПоТрудовымСоглашениям.ФизЛицо
		|ИЗ
		|	РегистрСведений.СотрудникиПоТрудовымСоглашениям КАК СотрудникиПоТрудовымСоглашениям
		|ГДЕ
		|	СотрудникиПоТрудовымСоглашениям.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СотрудникиПоТрудовымСоглашениям.Организация = &Организация
		|	И СотрудникиПоТрудовымСоглашениям.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПрочиеФизЛица.ФизЛицо
		|ИЗ
		|	ВременнаяТаблицаПрочиеФизЛица КАК ВременнаяТаблицаПрочиеФизЛица
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодоходныйНалогОбороты.ФизЛицо КАК ФизЛицо,
		|	ВЫБОР
		|		КОГДА ПодоходныйНалогОбороты.ОДПНОборот = 0
		|			ТОГДА 0
		|		ИНАЧЕ ПодоходныйНалогОбороты.ОДПНОборот - ПодоходныйНалогОбороты.ПФРДляРасчетаПНОборот - ПодоходныйНалогОбороты.ГНПФРДляРасчетаПНОборот - ПодоходныйНалогОбороты.ВычетыОборот * 100
		|	КОНЕЦ КАК ОДПН,
		|	ПодоходныйНалогОбороты.ПНОборот КАК СуммаПН
		|ПОМЕСТИТЬ ВременнаяТаблицаПН
		|ИЗ
		|	РегистрНакопления.ПодоходныйНалог.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Организация = &Организация
		|				И ФизЛицо В
		|					(ВЫБРАТЬ
		|						ВременнаяТаблицаСотрудникиПоТрудовымСоглашениям.ФизЛицо КАК ФизЛицо
		|					ИЗ
		|						ВременнаяТаблицаСотрудникиПоТрудовымСоглашениям КАК ВременнаяТаблицаСотрудникиПоТрудовымСоглашениям)) КАК ПодоходныйНалогОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПрочиеФизЛица.ФизЛицо,
		|	ВременнаяТаблицаПрочиеФизЛица.СуммаПН * 10,
		|	ВременнаяТаблицаПрочиеФизЛица.СуммаПН
		|ИЗ
		|	ВременнаяТаблицаПрочиеФизЛица КАК ВременнаяТаблицаПрочиеФизЛица
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГражданствоФизическихЛицСрезПоследних.ФизЛицо КАК Физлицо,
		|	ГражданствоФизическихЛицСрезПоследних.Страна КАК Страна
		|ПОМЕСТИТЬ ВременнаяТаблицаГражданство
		|ИЗ
		|	РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(
		|			&КонецПериода,
		|			ФизЛицо В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаПН.ФизЛицо
		|				ИЗ
		|					ВременнаяТаблицаПН КАК ВременнаяТаблицаПН)) КАК ГражданствоФизическихЛицСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПН.ФизЛицо КАК Физлицо,
		|	""001"" КАК КодДохода,
		|	ВременнаяТаблицаПН.ОДПН КАК ОДПН,
		|	ВременнаяТаблицаПН.СуммаПН КАК СуммаПН,
		|	ЕСТЬNULL(ВременнаяТаблицаГражданство.Страна.Код, """") КАК КодСтраны,
		|	ВременнаяТаблицаПН.ФизЛицо.ИНН КАК НомерНалоговойРегистрации
		|ИЗ
		|	ВременнаяТаблицаПН КАК ВременнаяТаблицаПН
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаГражданство КАК ВременнаяТаблицаГражданство
		|		ПО ВременнаяТаблицаПН.ФизЛицо = ВременнаяТаблицаГражданство.Физлицо";
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	СчетУчетаПоПНДляПрочихФизическихЛиц = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьДанныеУчетнойПолитикиПоПерсоналу(Дата, Организация).СчетУчетаПоПНДляПрочихФизическихЛиц;
	Запрос.УстановитьПараметр("СчетУчетаПоПНДляПрочихФизическихЛиц", СчетУчетаПоПНДляПрочихФизическихЛиц);
	
	Отчет.Загрузить(Запрос.Выполнить().Выгрузить());
			
КонецПроцедуры // ЗаполнитьТабличнуюЧастьОтчет()

// Процедура заполняет табличную часть
//
Процедура ЗаполнитьТабличнуюЧастьОтчетГодовой() Экспорт
	
	// Годовой отчет формируется только по сотрудникам,
	// на которых оформлен документ "Прием на работу" (штатные).
	Запрос = Новый Запрос;   
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСрезПоследних.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВременнаяТаблицаСотрудники
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК СотрудникиСрезПоследних
		|ГДЕ
		|	НЕ СотрудникиСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Сотрудники.ФизЛицо
		|ИЗ
		|	РегистрСведений.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Сотрудники.Организация = &Организация
		|	И Сотрудники.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОбороты.СубконтоДт1 КАК ФизЛицо,
		|	ХозрасчетныйОбороты.СуммаОборот КАК ВсегоВыплаченноДохода
		|ПОМЕСТИТЬ ВременнаяТаблицаДоходы
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			СчетДт = &Счет3520,
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СотрудникиОрганизаций),
		|			СчетКт В ИЕРАРХИИ (&Счет1100)
		|				ИЛИ СчетКт В ИЕРАРХИИ (&Счет1200)
		|				ИЛИ СчетКт = &Счет1520,
		|			,
		|			Организация = &Организация
		|				И СубконтоДт1 В
		|					(ВЫБРАТЬ
		|						ВременнаяТаблицаСотрудники.ФизЛицо КАК ФизЛицо
		|					ИЗ
		|						ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники)) КАК ХозрасчетныйОбороты
		|ГДЕ
		|	НЕ &ЗаполнятьВыплатуПНПоНачислениям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодоходныйНалогОбороты.ФизЛицо КАК Физлицо,
		|	ВЫБОР
		|		КОГДА ПодоходныйНалогОбороты.ОДПНОборот = 0
		|			ТОГДА 0
		|		ИНАЧЕ ПодоходныйНалогОбороты.ОДПНОборот - ПодоходныйНалогОбороты.ПФРДляРасчетаПНОборот - ПодоходныйНалогОбороты.ГНПФРДляРасчетаПНОборот - ПодоходныйНалогОбороты.ВычетыОборот * 100
		|	КОНЕЦ КАК ОДПН,
		|	ПодоходныйНалогОбороты.ПНОборот КАК СуммаПН,
		|	ПодоходныйНалогОбороты.ФизЛицо.ИНН КАК ИНН,
		|	""001"" КАК КодДохода,
		|	0 КАК СуммаМатериальнойВыгоды,
		|	0 КАК СуммаПНСМатериальнойВыгоды,
		|	ВЫБОР
		|		КОГДА &ЗаполнятьВыплатуПНПоНачислениям
		|			ТОГДА ПодоходныйНалогОбороты.ВсегоНачисленоОборот - ПодоходныйНалогОбороты.ПФРДляРасчетаПНОборот - ПодоходныйНалогОбороты.ГНПФРДляРасчетаПНОборот - ПодоходныйНалогОбороты.ПНОборот
		|		ИНАЧЕ ЕСТЬNULL(ВременнаяТаблицаДоходы.ВсегоВыплаченноДохода, 0)
		|	КОНЕЦ КАК ВсегоВыплаченноДохода
		|ИЗ
		|	РегистрНакопления.ПодоходныйНалог.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Организация = &Организация
		|				И ФизЛицо В
		|					(ВЫБРАТЬ
		|						ВременнаяТаблицаСотрудники.ФизЛицо КАК ФизЛицо
		|					ИЗ
		|						ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники)) КАК ПодоходныйНалогОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаДоходы КАК ВременнаяТаблицаДоходы
		|		ПО ПодоходныйНалогОбороты.ФизЛицо = ВременнаяТаблицаДоходы.ФизЛицо";
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Организация);	
	Запрос.УстановитьПараметр("Счет3520", ПланыСчетов.Хозрасчетный.НачисленнаяЗаработнаяПлата);
	Запрос.УстановитьПараметр("Счет1100", ПланыСчетов.Хозрасчетный.ДенежныеСредстваВКассе);
	Запрос.УстановитьПараметр("Счет1200", ПланыСчетов.Хозрасчетный.ДенежныеСредстваВБанке);
	Запрос.УстановитьПараметр("Счет1520", ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
	Запрос.УстановитьПараметр("ЗаполнятьВыплатуПНПоНачислениям", Константы.ЗаполнятьВыплатуПНПоНачислениям.Получить());
	
	ОтчетГодовой.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры // ЗаполнитьТабличнуюЧастьОтчетГодовой()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
